seabears/Stm32_Test/Bootloader_DFU/USB/Inc/usbd_conf.h
#ifndef __USBD_CONF_H__
#define __USBD_CONF_H__

#ifdef __cplusplus
extern "C" {
#endif

#include "stm32f1xx.h"
#include "stm32f1xx_hal.h"

#define USBD_MAX_NUM_INTERFACES     1U
#define USBD_MAX_NUM_CONFIGURATION  1U
#define USBD_MAX_STR_DESC_SIZ       512U
#define USBD_DEBUG_LEVEL            0U
#define USBD_LPM_ENABLED            0U
#define USBD_SELF_POWERED           1U
#define USB_SIZ_STRING_SERIAL       0x1AU

#define DEVICE_FS                   0U
#define USBD_DFU_MAX_ITF_NUM        1U
#define USBD_DFU_XFER_SIZE          1024U
#define USBD_DFU_APP_DEFAULT_ADD    0x08004000U
#define APP_DEFAULT_ADD             USBD_DFU_APP_DEFAULT_ADD

void Error_Handler(void);
void *USBD_static_malloc(uint32_t size);
void USBD_static_free(void *p);
void USBD_Delay(uint32_t Delay);

#define USBD_malloc  USBD_static_malloc
#define USBD_free    USBD_static_free

#define USBD_UsrLog(...)
#define USBD_ErrLog(...)
#define USBD_DbgLog(...)

#ifdef __cplusplus
}
#endif

#endif /* __USBD_CONF_H__ */